Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_РежимыОткрытияДокументаОбмена/SUI_РежимыОткрытияДокументаОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_РежимыОткрытияДокументаОбмена</name>
  <enumValues>
    <name>Просмотр</name>
  </enumValues>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>ДокументОбмена</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_ДокументыОбменаКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ПодключаемыеКомандыSimple

Процедура ОткрытьВыгрузкуДокументаНаТСД(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	ОткрытьФормуДокументаОбмена(ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Выгрузка"),
		ДокументСсылка, ПараметрыВыполнения);
	
КонецПроцедуры  

Процедура ОткрытьПросмотрДокументаИзТСД(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	ОткрытьФормуДокументаОбмена(ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Просмотр"),
		ДокументСсылка, ПараметрыВыполнения);
	
КонецПроцедуры

Процедура ОткрытьЗагрузкуДокументаИзТСД(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	СтатусОбработкиДОкумента = SUI_ДокументыОбменаВызовСервера.ДокументНуждаетсяВОбработке(ДокументСсылка);
	Если Не SUI_ДокументыОбменаКлиентПереопределяемый.ЕстьВозможностьОткрытьЗагрузкуДокумента(СтатусОбработкиДОкумента, ДокументСсылка) Тогда
		Возврат;
	ИначеЕсли СтатусОбработкиДОкумента.ЕстьАктивныеЗадания Тогда
		Если СтатусОбработкиДОкумента.ЕстьОшибкаОбработки Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'При обработке документа %1 регламентными заданиями возникла ошибка. Проверьте в очереди заданий или в журнале регистрации.'"), ДокументСсылка));	
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Документ: %1 не обработан регламентными заданиями. Дождитесь обработки и попробуйте снова.'"), ДокументСсылка));
		КонецЕсли;
	ИначеЕсли SUI_ДокументыОбменаВызовСервера.ЭтоДокументГрупповогоПересчета(ДокументСсылка) Тогда
		
		ДополнительныеПараметры = Новый Структура;
        ДополнительныеПараметры.Вставить("ДокументСсылка", ДокументСсылка);
	    ДополнительныеПараметры.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("КомандаЗагрузитьПослеПодтверждения", ЭтотОбъект, ДополнительныеПараметры);	
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Выбран документ с групповой работой: %1. Завершить его обработку и пересчитать итоги?'"), 
			ДокументСсылка);   	
		
		ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ЗавершитьРаботуСДокументом(ДокументСсылка, ПараметрыВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьДокументОбменаПоСсылке(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	ОткрытьФормуДокументаОбмена(ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.ДокументОбмена"),
		ДокументСсылка, ПараметрыВыполнения);

КонецПроцедуры

Процедура УдалитьРанееВыгруженныеДанные(Документы, ПараметрыВыполнения) Экспорт
	
	Если Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Вы действительно хотите удалить ранее выгруженные данные?
	|
	|Документы:'");
	
	Для Счетчик = 1 По Документы.Количество() Цикл
        
        ТекстВопроса = ТекстВопроса + Символы.ПС;
        
		Если Счетчик > 10 Тогда
			ТекстВопроса = ТекстВопроса + Символы.ПС + СтрШаблон(НСтр("ru = ' - еще %1 документ(-ов)'"), Документы.Количество() - Счетчик - 1);
			Прервать;
		КонецЕсли;
		
		ТекстВопроса = ТекстВопроса + " - " + Строка(Документы[Счетчик-1]);
		
    КонецЦикла;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьРанееВыгруженныеДанныеПослеПодтверждения", ЭтотОбъект, Документы);
	
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ОткрытьЖурналРегистрации(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	SUI_ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(
		SUI_ДокументыОбменаКлиентСервер.ПараметрыОткрытияЖурналаРегистрации(ДокументСсылка), ПараметрыВыполнения.Форма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьДокументОбменаПослеВыбораНастройкиBeta(ВыбраннаяНастройка, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда
		Возврат;
	КонецЕсли;

	ИмяФормы = "";
	
	Если ДополнительныеПараметры.ПараметрыОткрытия.РежимОткрытия = ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Выгрузка") Тогда
		ИмяФормы = "ОбщаяФорма.SUI_ВыгрузкаДокументаНаТСД";
	ИначеЕсли ДополнительныеПараметры.ПараметрыОткрытия.РежимОткрытия = ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Загрузка") Тогда 
		
		Если ДополнительныеПараметры.Свойство("ПропуститьПотокШК") Тогда
			ИмяФормы = "ОбщаяФорма.SUI_ЗагрузкаДокументаИзТСД";
		Иначе
			ПроверитьПотокШКПриЗагрузке(ВыбраннаяНастройка, ДополнительныеПараметры);
			Возврат;
		КонецЕсли;
	
	ИначеЕсли ДополнительныеПараметры.ПараметрыОткрытия.РежимОткрытия = ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Просмотр") Тогда	
		ИмяФормы = "ОбщаяФорма.SUI_ЗагрузкаДокументаИзТСД";
	ИначеЕсли ДополнительныеПараметры.ПараметрыОткрытия.РежимОткрытия = ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.ДокументОбмена") Тогда	
		
		СтруктураЗаписи = Новый Структура();
		СтруктураЗаписи.Вставить("id_doc", SUI_ИнтеграцияВКонфигурациюВызовСервера.ИдентификаторSimpleПоСсылке(
			ДополнительныеПараметры.ПараметрыОткрытия.ДокументСсылка));
		СтруктураЗаписи.Вставить("НастройкаДокумента", ВыбраннаяНастройка);
		СтруктураЗаписи.Вставить("sid", SUI_ДокументыОбменаВызовСервера.ПолучитьSIDДокументаОбменаПоСсылкеДокумента(
			СтруктураЗаписи.id_doc, СтруктураЗаписи.НастройкаДокумента));

		Если СтруктураЗаписи.sid.Количество() = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 и по настройке %2 не удалось найти SID.'"), 
				ДополнительныеПараметры.ПараметрыОткрытия.ДокументСсылка,
				ВыбраннаяНастройка));
		Иначе
			СтруктураЗаписи.sid = СтруктураЗаписи.sid[0];
			ДополнительныеПараметры.ПараметрыОткрытия = Новый Структура("Ключ", Новый ("РегистрСведенийКлючЗаписи.SUI_docs", 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураЗаписи)));
			ИмяФормы = "РегистрСведений.SUI_docs.ФормаЗаписи";
		КонецЕсли;

	КонецЕсли;

	Если ПустаяСтрока(ИмяФормы) Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры.ПараметрыОткрытия.Вставить("НастройкаДокумента", ВыбраннаяНастройка);
	
	ОткрытьФорму(ИмяФормы, 
		ДополнительныеПараметры.ПараметрыОткрытия, 
		ДополнительныеПараметры.ПараметрыВыполнения.Форма, 
		ДополнительныеПараметры.ПараметрыВыполнения.Форма.УникальныйИдентификатор);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуДокументаОбмена(РежимОткрытия, ДокументСсылка, ПараметрыВыполнения)
	
	ОчиститьСообщения();
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДокументСсылка", ДокументСсылка);
	ПараметрыОткрытия.Вставить("РежимОткрытия", РежимОткрытия);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьДокументОбменаПослеВыбораНастройкиBeta", ЭтотОбъект, 
		Новый Структура("ПараметрыВыполнения, ПараметрыОткрытия", ПараметрыВыполнения, ПараметрыОткрытия));
	
	Если СтрНачинаетсяС(ПараметрыВыполнения.Форма.ИмяФормы, "Обработка.SUI_РабочееМестоОператораОбмена.") И
		ПараметрыВыполнения.Форма.Элементы.Найти("СписокДокументовОбмена") <> Неопределено И
		ПараметрыВыполнения.Форма.Элементы.СписокДокументовОбмена.ТекущиеДанные <> Неопределено Тогда
		НастройкиДокумента = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			ПараметрыВыполнения.Форма.Элементы.СписокДокументовОбмена.ТекущиеДанные.НастройкаДокумента);
	Иначе
		НастройкиДокумента = SUI_НастройкиДокументовВызовСервера.ПолучитьНастройкиДокумента(ДокументСсылка, 
			(РежимОткрытия <> ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Выгрузка")));
	КонецЕсли;
	
	Если НастройкиДокумента.Количество() = 0 Тогда
		Если РежимОткрытия <> ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Выгрузка") Тогда
			ШаблонСообщения = НСтр("ru = 'Для документа %1 отсутствуют настройки обмена по которым он был выгружен.'");
		Иначе
			ШаблонСообщения = НСтр("ru = 'Для документа %1 отсутствуют настройки обмена.'");
		КонецЕсли;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ДокументСсылка));
	ИначеЕсли НастройкиДокумента.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(Оповещение, НастройкиДокумента[0]);
	Иначе
		СписокНастроек = Новый СписокЗначений;
		СписокНастроек.ЗагрузитьЗначения(НастройкиДокумента);
		
		ОткрытьФорму("ОбщаяФорма.SUI_ВыборИзСписка", 
			Новый Структура("СписокВыбора, Заголовок", СписокНастроек, НСтр("ru = 'Выберите настройку документа'")), 
			ПараметрыВыполнения.Форма, 
			ПараметрыВыполнения.Форма.УникальныйИдентификатор, , , 
			Оповещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьРанееВыгруженныеДанныеПослеПодтверждения(Ответ, Документы) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	SUI_ДокументыОбменаВызовСервера.УдалитьДанныеДокументовОбмена(Документы);

	Оповестить("SUI_ПослеУдаленияДокументовОбмена");

КонецПроцедуры

Процедура ПроверитьПотокШКПриЗагрузке(ВыбраннаяНастройка, ДополнительныеПараметры)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьПотокШКПриЗагрузкеПослеОтветаНаВопрос", ЭтотОбъект, 
		Новый Структура("ВыбраннаяНастройка, ДополнительныеПараметры", ВыбраннаяНастройка, ДополнительныеПараметры));
	
	РезультатПроверки = SUI_ДокументыОбменаВызовСервера.ДокументОбменаСодержитДанныеПотокаШтрихкодов(
		ДополнительныеПараметры.ПараметрыОткрытия.ДокументСсылка, ВыбраннаяНастройка);
	
	Если РезультатПроверки.ЕстьПотокШК И Не РезультатПроверки.ЭтоДокументСборШК Тогда
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Для документа есть данные потока штрихкодов.
		|Открыть форму сопоставления данных потока штрихкодов?'"), РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПотокШКПриЗагрузкеПослеОтветаНаВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьПотокШКПриЗагрузкеЗавершение", 
		ЭтотОбъект, ДополнительныеПараметры);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ДопПараметры = ДополнительныеПараметры.ДополнительныеПараметры;
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("ДокументСсылка", ДопПараметры.ПараметрыОткрытия.ДокументСсылка);
		ПараметрыОткрытия.Вставить("НастройкаДокумента", ДополнительныеПараметры.ВыбраннаяНастройка);
		
		ОткрытьФорму("Обработка.SUI_ОбработкаПотокаШтрихкодов.Форма", 
			ПараметрыОткрытия, 
			ДопПараметры.ПараметрыВыполнения.Форма, 
			ДопПараметры.ПараметрыВыполнения.Форма.УникальныйИдентификатор, , , 
			ОповещениеОЗавершении);
			
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ?(Ответ = КодВозвратаДиалога.Нет, Истина, Неопределено));
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПотокШКПриЗагрузкеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = ДополнительныеПараметры.ДополнительныеПараметры;
	ДопПараметры.Вставить("ПропуститьПотокШК");
	
	ОткрытьДокументОбменаПослеВыбораНастройкиBeta(ДополнительныеПараметры.ВыбраннаяНастройка, ДопПараметры);

КонецПроцедуры

Процедура КомандаЗагрузитьПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
		                      
	Если SUI_ДокументыОбменаВызовСервера.ЗавершитьГрупповойПересчетДокумента(ДополнительныеПараметры.ДокументСсылка, Истина) Тогда
		ЗавершитьРаботуСДокументом(ДополнительныеПараметры.ДокументСсылка, ДополнительныеПараметры.ПараметрыВыполнения);	
	Иначе  	
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Не удалось завершить обработку группового документа: %1.'"), ДополнительныеПараметры.ДокументСсылка));		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗавершитьРаботуСДокументом(Ссылка, ПараметрыВыполнения)

	ОткрытьФормуДокументаОбмена(ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Загрузка"),
		Ссылка, ПараметрыВыполнения);
		
КонецПроцедуры 

#КонецОбласти
